
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/AI1411/terraform-ecs/actions/runs/4628465898)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-01e8f0711944f630e]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0e045ce1b00c1ae71]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09546da07a4d3a277]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:459535173592:targetgroup/golang-simple-grpc-server-tg/6d51f00e08691e38]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-034910cb1cab13f5d]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0d3200ffc3ea6afea]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-02e8ee5062f5fe950]
aws_security_group.ecs: Refreshing state... [id=sg-072ed778c4dcf4979]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b14a6d3c53e3d5f7]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-04f10a644e50be262]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08bd2e8d1f95541a0]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-03b1e0e9db27f8104]
aws_security_group.alb: Refreshing state... [id=sg-0913f06e7e46d9d88]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02b5539fe45e6327b]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0053b16448220511f]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0e9905288523882a7]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-03b1e0e9db27f81041080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-017b30897b472f820]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dc05b5fb1b3132df]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1318507288]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:459535173592:loadbalancer/app/golang-simple-grpc-server-alb/283f2e95656ad05f]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-018706a2db074f9f1]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0bf2e0c94a12ca98a]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-04f10a644e50be2621080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0d3200ffc3ea6afea1080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:459535173592:listener/app/golang-simple-grpc-server-alb/283f2e95656ad05f/1340e81c30d6da98]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "golang-simple-grpc-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "golang-simple-grpc-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:459535173592:listener/app/golang-simple-grpc-server-alb/283f2e95656ad05f/1340e81c30d6da98"
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:459535173592:targetgroup/golang-simple-grpc-server-tg/6d51f00e08691e38"
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=golang-simple-grpc-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:459535173592:listener-rule/app/golang-simple-grpc-server-alb/283f2e95656ad05f/1340e81c30d6da98/60202c9acb8e5e97]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=golang-simple-grpc-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"0dfdae2f5ab7403cd9a9031466c83d1bd55cf734","Vars":{},"WorkflowName":"Terraform"} -->